queryPostPaidBill/templates/payloads/payment.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ars="http://www.huawei.com/bme/cbsinterface/arservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon">
   <soapenv:Header/>
   <soapenv:Body>
      <ars:PaymentRequestMsg>
         <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:MessageSeq>${=new java.text.SimpleDateFormat("yyyy-MM-dd'T'HH:mm:ss.SSS").format(new Date())}</cbs:MessageSeq>
            <cbs:OwnershipInfo>
               <cbs:BEID>101</cbs:BEID>
               <cbs:BRID>101</cbs:BRID>
            </cbs:OwnershipInfo>
            <cbs:AccessSecurity>
               <cbs:LoginSystemCode>102</cbs:LoginSystemCode>
               <cbs:Password>7/PuyYwNpRtSX7jDpxnl2ECAvuVYH2Mu9zxqgPGJrPYYK73MCZN7DvrDepA=</cbs:Password>
            </cbs:AccessSecurity>
            <cbs:OperatorInfo>
               <cbs:OperatorID>101</cbs:OperatorID>
            </cbs:OperatorInfo>
         </RequestHeader>
         <PaymentRequest>
            <ars:PaymentSerialNo>$serialNo</ars:PaymentSerialNo>
            <ars:PaymentChannelID>$channelId</ars:PaymentChannelID>
            <ars:OpType>$opType</ars:OpType>
            <ars:PaymentObj>
               <ars:AcctAccessCode>
                  <!--You have a CHOICE of the next 3 items at this level-->
                  <arc:PrimaryIdentity>$msisdn</arc:PrimaryIdentity>
                  <ars:PayType>$payType</ars:PayType>
               </ars:AcctAccessCode>
            </ars:PaymentObj>
            <ars:PaymentInfo>
               <ars:CashPayment>
                  <ars:Amount>$amount</ars:Amount>
                  <ars:BankInfo>
                     <arc:BankCode>$bankCode</arc:BankCode>
                  </ars:BankInfo>
               </ars:CashPayment>
            </ars:PaymentInfo>
            <ars:AdditionalProperty>
               <arc:Code>CN_AU</arc:Code>
               <arc:Value>$cn_au</arc:Value>
            </ars:AdditionalProperty>
         </PaymentRequest>
      </ars:PaymentRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>